---
kind: type
id: T:Autodesk.Revit.DB.Fabrication.FabricationUtils
source: html/f7bafc3d-3697-e591-ebec-e7ca643422f9.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationUtils

General utility methods in the Autodesk Revit MEP product for fabrication.

## Syntax (C#)
```csharp
public static class FabricationUtils
```